Revit 2024 API
StairsType.RightLateralOffset Property
 The offset for the right support from the edge of the run in a horizontal direction.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double RightLateralOffset { get; set; }
Visual Basic
Public Property RightLateralOffset As Double
	Get
	Set
Visual C++
public:
property double RightLateralOffset {
	double get ();
	void set (double value);
}
Field Value
 0 if the right support is not carriage(open).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for offset must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The right support style is not carriage(open), so this related data cannot be set.
See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace